["http://www.loc.gov/mads/rdf/v1#","http://id.loc.gov/ontologies/bflc/","http://xmlns.com/foaf/0.1/","http://www.w3.org/1999/02/22-rdf-syntax-ns#","http://www.w3.org/2000/01/rdf-schema#","http://yago-knowledge.org/resource/","http://dbpedia.org/ontology/","http://dbpedia.org/property/","http://example.org/","http://purl.org/dc/elements/1.1/","http://www.w3.org/2002/07/owl#","http://purl.org/goodrelations/v1#","http://data.ordnancesurvey.co.uk/ontology/spatialrelations/","http://www.w3.org/2004/02/skos/core#","http://www.opengis.net/ont/geosparql#","http://www.w3.org/ns/dcat#","http://schema.org/","http://www.w3.org/2001/XMLSchema#","http://id.loc.gov/ontologies/bibframe/","http://sindice.com/vocab/search#","http://purl.org/dc/terms/","http://purl.org/linked-data/cube#","http://www.w3.org/ns/org#","http://www.w3.org/ns/sparql-service-description#","http://www.w3.org/ns/prov#","http://purl.org/vocab/frbr/core#","http://www.w3.org/ns/posix/stat#","http://rdfs.org/sioc/ns#","http://purl.org/xtypes/","http://purl.org/net/ns/ontology-annot#","http://dbpedia.org/resource/","http://www.w3.org/2006/vcard/ns#","http://rdfs.org/ns/void#","http://search.yahoo.com/searchmonkey/commerce/","http://www.ontotext.com/","http://purl.org/rss/1.0/","http://purl.org/ontology/bibo/","http://www.w3.org/ns/people#","http://semanticscience.org/resource/","http://www.geonames.org/ontology#","http://purl.org/NET/c4dm/event.owl#","http://www.productontology.org/id/","http://rdf.freebase.com/ns/","http://www.wikidata.org/entity/","http://purl.org/dc/dcmitype/","http://purl.org/openorg/","http://creativecommons.org/ns#","http://usefulinc.com/ns/doap#","http://www.w3.org/ns/md#","http://purl.org/gen/0.1#","http://www.w3.org/ns/r2rml#","http://purl.org/science/owl/sciencecommons/","http://purl.org/rss/1.0/modules/content/","http://swrc.ontoware.org/ontology#","http://purl.org/vocab/vann/","http://www.w3.org/2011/http#","http://purl.org/prog/","http://www.semanticdesktop.org/ontologies/2007/01/19/nie#","http://purl.obolibrary.org/obo/","http://www.w3.org/ns/ma-ont#","http://xmlns.com/wot/0.1/","http://purl.org/NET/c4dm/timeline.owl#","http://www.aktors.org/ontology/portal#","http://open.vocab.org/terms/","http://www.w3.org/2005/xpath-functions#","http://rdfs.org/resume-rdf/","http://purl.org/vocab/aiiso/schema#","http://data.semanticweb.org/ns/swc/ontology#","http://www.w3.org/2003/06/sw-vocab-status/ns#","http://www.cidoc-crm.org/cidoc-crm/","http://id.loc.gov/vocabulary/relators/","http://www.w3.org/2002/12/cal/ical#","http://www.w3.org/ns/earl#","http://www.w3.org/1999/xhtml#","http://purl.org/ontology/mo/","http://purl.org/vocab/bio/0.1/","http://purl.org/vocab/relationship/","http://ontology.cybershare.utep.edu/dbowl/relational-to-ontology-mapping-primitive.owl#","http://purl.org/ontology/daia/","http://www.w3.org/2004/03/trix/rdfg-1/","http://purl.org/vocab/changeset/schema#","http://schemas.talis.com/2005/address/schema#","http://purl.org/dc/dcam/","http://ns.adobe.com/xap/1.0/","http://www.rdfabout.com/rdf/schema/usbill/","http://this.invalid/test2#","http://rdf.data-vocabulary.org/#","http://wifo5-04.informatik.uni-mannheim.de/factbook/ns#","http://www.w3.org/1999/xhtml/vocab#","http://purl.org/ontology/co/core#","http://purl.org/ontology/similarity/","http://ogp.me/ns#","http://dig.csail.mit.edu/TAMI/2007/amord/air#","http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#","http://www.w3.org/2000/10/swap/log#","http://www.ontologydesignpatterns.org/cp/owl/informationrealization.owl#","http://purl.org/NET/book/vocab#","http://search.yahoo.com/searchmonkey/media/","http://webns.net/mvcb/","http://jena.hpl.hp.com/ARQ/function#","http://mu.semte.ch/vocabularies/core/","http://gmpg.org/xfn/11#","http://purl.org/net/biblio#","http://purl.org/procurement/public-contracts#","http://commontag.org/ns#","http://www.w3.org/2006/timezone#","http://purl.oclc.org/NET/sism/0.1/","http://purl.org/NET/biol/botany#","http://ontologi.es/days#","http://www.w3.org/2002/xforms/","http://purl.org/dc/qualifiers/1.0/","http://www.holygoat.co.uk/owl/redwood/0.1/tags/","http://purl.org/reco#","http://www.w3.org/2006/time#","http://schemas.talis.com/2005/dir/schema#","http://purl.org/cld/terms/","http://www.ordnancesurvey.co.uk/ontology/AdministrativeGeography/v2.0/AdministrativeGeography.rdf#","http://qudt.org/vocab/unit/","http://www.w3.org/2007/rif#","http://purl.org/ontology/af/","http://purl.org/ontology/myspace#","http://www.openrdf.org/config/repository/sail#","http://purl.org/ontomedia/core/expression#","http://www.ontologydesignpatterns.org/cp/owl/componency.owl#","http://purl.org/linked-data/sdmx#","http://ontologies.smile.deri.ie/2009/02/27/memo#","http://purl.org/stuff/rev#","http://www.w3.org/2000/10/swap/math#","http://d2rq.org/terms/jdbc/","http://ontologi.es/giving#","http://www.w3.org/2000/10/swap/pim/contact#","http://sw.opencyc.org/concept/","http://okkam.org/terms#","http://purl.org/swan/1.2/qualifiers/","http://qudt.org/schema/qudt/","http://purl.org/swan/1.2/discourse-elements/","http://www.w3.org/2007/uwa/context/deliverycontext.owl#","http://www.ontotext.com/trree/owlim#","http://ltsc.ieee.org/rdf/lomv1p0/vocabulary#","http://www.w3.org/ns/oa#","https://www.w3.org/ns/activitystreams#","http://sw.deri.org/2005/08/conf/cfp.owl#","http://purl.org/linked-data/sdmx/2009/dimension#","http://publications.europa.eu/ontology/cdm#","http://open-multinet.info/ontology/omn#","http://ns.adobe.com/photoshop/1.0/","http://purl.org/linkingyou/","http://schemas.opengis.net/wfs/","http://www.w3.org/2003/12/exif/ns#","http://purl.org/linked-data/sdmx/2009/attribute#","http://opendata.caceres.es/def/ontomunicipio#","http://www.openlinksw.com/schemas/virtrdf#","https://webiomed.ai/blog/obzor-rossiiskikh-sistem-podderzhki-priniatiia-vrachebnykh-reshenii/","http://www.w3.org/2008/05/skos-xl#","http://www.w3.org/2001/XMLSchema-instance#","http://www.w3.org/ns/adms#","http://lemon-model.net/lemon#","http://www.w3.org/2003/11/swrl#","http://iflastandards.info/ns/isbd/elements/","http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#","http://dbpedia.org/","http://www.w3.org/ns/auth/cert#","http://persistence.uni-leipzig.org/nlp2rdf/ontologies/nif-core#","http://www.europeana.eu/schemas/edm/","http://www.morelab.deusto.es/ontologies/swrcfe#","http://www.w3.org/2011/content#","http://www.openarchives.org/ore/terms/","http://purl.org/spar/fabio/","http://www.w3.org/2003/11/swrlb#","http://www.eat.rl.ac.uk/#","http://umbel.org/umbel/ac/","http://vocab.gtfs.org/terms#","http://www.semanticdesktop.org/ontologies/2007/03/22/nfo#","http://purl.org/vocommons/voaf#","http://vocab.getty.edu/aat/","http://vocab.getty.edu/ontology#","http://www.opengis.net/ont/sf#","http://prismstandard.org/namespaces/basic/2.0/","http://www.w3.org/ns/shacl#","http://purl.org/NET/scovo#","http://www.example.org/","http://rdfs.org/sioc/types#","http://vocab.getty.edu/tgn/","http://rdfs.org/sioc/services#","http://test2.example.com/","http://geo.linkeddata.es/resource/","http://www.w3.org/ns/ldp#","http://vocab.deri.ie/rooms#","http://vocab.getty.edu/ulan/","http://vivoweb.org/ontology/core#","http://purl.uniprot.org/core/","http://www4.wiwiss.fu-berlin.de/drugbank/resource/drugbank/","http://www.rkbexplorer.com/ontologies/coref#","http://dbpedia.org/resource/Category:","http://www.wikidata.org/prop/direct/","http://www.w3.org/ns/ssn/","http://inference-web.org/2.0/pml-justification.owl#","http://www.w3.org/2009/pointers#","http://purl.org/lobid/lv#","http://purl.org/obo/owl/GO#","http://www.georss.org/georss/","http://purl.org/linguistics/gold/","http://purl.org/NET/acc#","http://www.openlinksw.com/schemas/bif#","http://prefix.cc/nsogi:","http://www.w3.org/2000/10/swap/pim/doc#","https://cuzin.com/","http://data.linkedmdb.org/resource/movie/","http://musicontology.com/","http://www.kanzaki.com/ns/whois#","http://vocab.deri.ie/am#","http://www.lexinfo.net/ontology/3.0/lexinfo#","http://www.w3.org/ns/auth/rsa#","https://linkeddata.cultureelerfgoed.nl/vocab/def/ceo#","http://purl.org/net/schemas/space/","http://vocabularies.wikipathways.org/wp#","http://www.w3.org/2005/11/its/rdf#","http://www.w3.org/2007/uwa/context/java.owl#","http://spi-fm.uca.es/neologism/cerif#","http://purl.org/ontology/rec/core#","http://www.ontologyrepository.com/CommonCoreOntologies/","http://d-nb.info/standards/elementset/gnd#","http://purl.org/obo/owl/ro#","http://www.aktors.org/ontology/support#","http://www.semanticdesktop.org/ontologies/2007/03/22/nmo#","http://linkedgeodata.org/triplify/","http://www.loc.gov/mods/v3#","http://dblp.uni-trier.de/rdf/schema-2015-01-26#","http://www.w3.org/ns/sparql#","http://schemas.microsoft.com/imm/","http://purl.org/hpi/patchr#","http://www.semanticdesktop.org/ontologies/2007/08/15/nao#","http://xmlns.com/wordnet/1.6/","http://www.bigdata.com/rdf#","https://w3id.org/security#","http://www.ontologydesignpatterns.org/cp/owl/timeinterval.owl#","https://namso-gen.com/","http://purl.org/spar/cito/","http://www.w3.org/2007/uwa/context/location.owl#","http://www.w3.org/XML/1998/namespace/","http://www.w3.org/ns/auth/acl#","http://www4.wiwiss.fu-berlin.de/sider/resource/sider/","http://www.w3.org/2007/ont/httph#","http://purl.org/commerce/product#","http://purl.org/ontology/service#","http://www.w3.org/2000/10/swap/list#","http://spinrdf.org/sp#","http://purl.org/ontology/po/","http://fise.iks-project.eu/ontology/","http://dati.camera.it/ocd/","http://linkedevents.org/ontology/","https://krr.triply.cc/krr/sameas-meta/def/","http://www.rkbexplorer.com/ontologies/acm#","http://dbpedia.org/owl/","http://bio2rdf.org/chebi:","http://rhizomik.net/ontologies/copyrightonto.owl#","http://d-nb.info/gnd/","http://eulersharp.sourceforge.net/2003/03swap/organism#","https://w3id.org/opm#","http://www.w3.org/2006/03/wn/wn20/schema/","http://rdf.ecs.soton.ac.uk/ontology/ecs#","http://data.ontotext.com/resource/leak/","http://www.w3.org/2007/05/powder-s#","http://deductions.sf.net/ontology/knowledge_base.owl#","http://www.w3.org/2005/Atom/","http://purl.org/NET/biol/zoology#","http://purl.org/net/provenance/ns#","http://blogs.yandex.ru/schema/foaf/","http://www.w3.org/ns/formats/","http://data.ign.fr/def/ignf#","http://umbel.org/umbel/rc/","https://es.scribd.com/doc/79794476/05-Ejercicios-Resueltos-Caja-Negra-y-Recapitulacion/","http://purl.org/ontology/video#","http://purl.org/olia/olia.owl#","http://spinrdf.org/spin#","http://www.example.org/rdf#","http://www.opengis.net/def/function/geosparql/","http://www.openrdf.org/schema/sesame#","http://www.w3.org/2007/uwa/context/web.owl#","http://purl.org/ontology/prv/core#","http://www.metadata.net/harmony/ABCSchemaV5Commented.rdf#","http://purl.org/obo/owl/MS#","http://semanticweb.org/id/","http://schemas.ogf.org/nml/2013/05/base#","http://www.w3.org/2001/sw/DataAccess/tests/test-manifest#","http://purl.org/olia/penn.owl#","http://www.ontologydesignpatterns.org/ont/web/irw.owl#","http://data.ordnancesurvey.co.uk/ontology/admingeo/","http://www.ontotext.com/proton/protonext#","http://www.semanticdesktop.org/ontologies/2007/03/22/nco#","https://rdfsharp.codeplex.com/","http://ns.ontowiki.net/SysOnt/Site/","http://rdf.histograph.io/","http://www.daml.org/2001/03/daml+oil#","http://purl.org/ontology/wo/","https://schema.org/","http://www.rkbexplorer.com/ontologies/resist#","http://www.w3.org/ns/hydra/core#","http://www.biopax.org/release/biopax-level3.owl#","http://data.ordnancesurvey.co.uk/id/postcodeunit/","http://reference.data.gov.uk/def/central-government/","http://www.ontologydesignpatterns.org/cp/owl/situation.owl#","http://www.ontologydesignpatterns.org/schemas/cpannotationschema.owl#","http://tipsy.googlecode.com/svn/trunk/vocab/pmt#","http://purl.org/pav/","http://protege.stanford.edu/system#","http://rdfs.org/scot/ns#","http://schemas.talis.com/2005/user/schema#","http://purl.org/ontomedia/ext/common/trait#","http://www.w3.org/2007/ont/link#","http://purl.org/net/vocab/2004/03/label#","http://www.w3.org/ns/lemon/ontolex#","http://topbraid.org/sparqlmotionfunctions#","http://purl.org/NET/biol/ns#","http://www.w3.org/2004/09/fresnel#","http://www.w3.org/2003/01/geo/wgs84_pos#","http://bio2rdf.org/core#","http://www.w3.org/ns/pim/space#","http://rdf-vocabulary.ddialliance.org/xkos#","http://eulersharp.sourceforge.net/2003/03swap/log-rules#","http://purl.org/innovation/ns#","http://www.purl.org/","http://www.w3id.org/simulation/ontology/","http://purl.org/foodontology#","http://purl.org/acco/ns#","http://ns.inria.fr/nicetag/2010/09/09/voc#","http://en.wikipedia.org/wiki/","http://purl.org/ontomedia/ext/common/being#","http://chem.deri.ie/granatum/","http://ns.inria.fr/sparql-template/","http://kaiko.getalp.org/dbnary#","http://spinrdf.org/spl#","http://iotschema.org/","http://uptheasset.org/ontology#","http://purl.org/ontology/mo/mit#","http://purl.org/twc/health/vocab/aggregate/","http://rdf-vocabulary.ddialliance.org/discovery#","https://bag2.basisregistraties.overheid.nl/bag/def/","http://www.rdfabout.com/rdf/schema/politico/","http://umbel.org/umbel#","http://purl.org/vocab/riro/sdl#","http://opencoinage.org/rdf/","http://purl.org/NET/decimalised#","http://demiblog.org/vocab/oauth#","http://iptc.org/std/rNews/2011-10-07#","http://www.w3.org/ns/lemon/lime#","http://climb.dataincubator.org/vocabs/climb/","http://rdaregistry.info/Elements/u/","http://standaarden.overheid.nl/owms/","http://purl.org/vocab/riro/gpt#","http://purl.org/ns/meteo#","http://www.rdfabout.com/rdf/schema/usfec/","http://www.w3.org/2006/gen/ont#","http://ns.nature.com/terms/","http://purl.org/ontology/sco#","http://www.dotnetrdf.org/leviathan#","http://purl.org/uco/ns#","http://a9.com/-/spec/opensearch/1.1/","http://purl.org/net/nknouf/ns/bibtex#","http://purl.org/stuff/project/","http://purl.org/twc/vocab/conversion/","http://vocab.org/waiver/terms/","http://purl.org/linked-data/api/vocab#","http://purl.org/NET/lx#","http://ramonantonio.net/doac/0.1/#","http://www.example.org/terms/","http://purl.org/rss/1.0/modules/taxonomy/","http://purl.org/net/compass#","http://purl.org/ontomedia/ext/common/bestiary#","http://www.ebi.ac.uk/efo/","http://purl.org/media/audio#","http://www.openrdf.org/config/sail/federation#","http://geovocab.org/geometry#","http://purl.org/iso25964/skos-thes#","https://w3id.org/payswarm#","http://www.w3.org/2007/05/powder#","http://reference.data.gov.uk/def/intervals/","http://www.semanticdesktop.org/ontologies/2008/05/20/tmo#","http://linkedgeodata.org/ontology/","http://buzzword.org.uk/rdf/atomix#","http://buzzword.org.uk/rdf/xen#","http://www.gutenberg.org/2009/pgterms/","http://langegger.at/xlwrap/vocab#","http://www.w3.org/2004/03/trix/swp-2/","https://w3id.org/seas/","http://biohackathon.org/resource/faldo#","http://dati.gov.it/onto/dcatapit#","http://bio2rdf.org/","http://kasei.us/about/foaf.xrdf#","http://www.openrdf.org/config/sail/custom#","https://cube.link/","http://cordis.europa.eu/projects/","http://rdvocab.info/RDARelationshipsWEMI/","http://www.bl.uk/schemas/bibliographic/blterms#","http://edamontology.org/","http://telegraphis.net/ontology/measurement/code#","http://www.openrdf.org/config/repository#","http://www.daml.org/2001/10/html/airport-ont#","http://ontologi.es/lang/core#","http://www.w3.org/2004/06/rei#","http://data.totl.net/game/","http://purl.org/ontomedia/core/space#","http://purl.org/xro/ns#","http://purl.org/library/","http://www.w3.org/2007/uwa/context/software.owl#","http://rdaregistry.info/Elements/c/","http://ontologi.es/profiling#","http://purl.org/twc/ontology/frir.owl#","http://www.ontologydesignpatterns.org/cpont/ire.owl#","http://ltsc.ieee.org/rdf/lomv1p0/lom#","http://philosurfical.open.ac.uk/ontology/philosurfical.owl#","http://www.w3.org/2000/10/swap/string#","http://bblfish.net/work/atom-owl/2006-06-06/#","http://purl.org/ontomedia/ext/common/profession#","http://buzzword.org.uk/rdf/xhtml-elements#","http://www.junkwork.net/xml/DocumentList#","http://www.w3.org/ns/regorg#","http://example.org/name#","http://purl.org/net/rdf-money/","http://purl.org/ontomedia/core/media#","http://rs.tdwg.org/dwc/terms/","http://worldbank.270a.info/dataset/","http://courseware.rkbexplorer.com/ontologies/courseware#","http://www.rdfabout.com/rdf/schema/usgovt/","http://eventography.org/sede/0.1/","http://wordnet-rdf.princeton.edu/ontology#","http://jena.hpl.hp.com/2008/tdb#","http://www.w3.org/2007/uwa/context/push.owl#","http://www.bbc.co.uk/ontologies/sport/","http://purl.org/ontology/last-fm/","http://www.w3.org/2000/10/swap/os#","http://www.w3.org/2007/uwa/context/hardware.owl#","http://www.semanticdesktop.org/ontologies/2007/08/15/nrl#","http://www.w3.org/2000/10/swap/crypto#","http://ontologi.es/rail/vocab#","http://purl.org/ontology/symbolic-music/","http://sw.cyc.com/CycAnnotations_v1#","http://www4.wiwiss.fu-berlin.de/dailymed/resource/dailymed/","http://purl.org/ontology/chord/","http://www.lehigh.edu/~zhp2/2004/0401/univ-bench.owl#","http://www.w3.org/ns/rdfa#","http://sindice.com/hlisting/0.1/","http://www.affymetrix.com/community/publications/affymetrix/tmsplice#","http://www.openrdf.org/rdf/2009/object#","http://semantic-mediawiki.org/swivt/1.0#","http://purl.org/ontology/pbo/core#","http://www.rdfabout.com/rdf/schema/vote/","http://purl.org/muto/core#","http://rdvocab.info/Elements/","http://ns.ontowiki.net/SysOnt/","http://lexvo.org/ontology#","http://online-presence.net/opo/ns#","http://www.w3.org/ns/locn#","http://purl.org/vocab/resourcelist/schema#","http://purl.org/NET/dady#","http://zeitkunst.org/bibtex/0.1/bibtex.owl#","https://w3id.org/role/","http://www.w3.org/2007/uwa/context/network.owl#","http://schemas.talis.com/2005/service/schema#","http://purl.org/tio/ns#","http://web-semantics.org/ns/mysql/","http://www.ontologydesignpatterns.org/ont/framenet/abox/lu/","http://www.w3.org/ns/person#","http://maven.apache.org/POM/4.0.0#","http://www.w3.org/ns/ui#","http://plugin.org.uk/swh-plugins/","http://www.w3.org/2002/12/cal/icaltzd#","http://data.linkedct.org/resource/linkedct/","http://ontologi.es/like#","http://openlinksw.com/schemas/oat/","http://lod.taxonconcept.org/ontology/txn.owl#","http://purl.org/ontology/is/types/","http://purl.org/twc/vocab/vsr#","http://www.w3.org/2007/uwa/context/common.owl#","http://www.opengis.net/ont/gml#","http://purl.org/court/def/2009/coin#","http://www.ebusiness-unibw.org/ontologies/eclass/5.1.4/#","http://www.aifb.kit.edu/id/","http://www.w3.org/2002/01/p3prdfv1#","http://www.openrdf.org/config/sail#","http://purl.org/NET/puc#","http://www.w3.org/2007/rif-builtin-action#","http://resex.rkbexplorer.com/ontologies/resex#","http://topbraid.org/sparqlmotionlib#","http://moat-project.org/ns#","http://vocab.deri.ie/cogs#","http://catalogus-professorum.org/cpm/2/","http://annotation.semanticweb.org/2004/iswc#","http://www.dotnetrdf.org/configuration#","http://purl.org/vocab/riro/ddl#","http://www.w3.org/2008/turtle#","http://purl.org/vocab/lifecycle/schema#","http://purl.org/swan/1.2/swan-commons/","http://purl.org/ontology/ao/core#","http://conserv.deri.ie/ontology#","http://purl.org/net/ns/wordmap#","http://www.lotico.com/resource/","http://bibframe.org/vocab/","http://www.w3.org/2005/07/aaa#","http://wikipedia.no/rdf/","http://viaf.org/viaf/","http://purl.org/commerce#","http://uriplay.org/spec/ontology/#","http://ns.inria.fr/ludo/v1#","http://www.lotico.com/meetup/","http://inference-web.org/2.0/pml-relation.owl#","http://www.semanticweb.org/ontologies/cheminf.owl#","http://www.semanticdesktop.org/ontologies/2007/05/10/nexif#","http://www.ontologydesignpatterns.org/cp/owl/informationobjectsandrepresentationlanguages.owl#","http://users.utcluj.ro/~raluca/rdf_ontologies_ralu/ralu_modified_ontology_pizzas2_0#","http://inference-web.org/2.0/pml-provenance.owl#","http://reference.data.gov.uk/def/payment#","http://dbkwik.webdatacommons.org/","http://purl.org/coo/ns#","http://purl.org/swan/1.2/discourse-relationships/","http://purl.org/net/hdlipcores/ontology/soc#","http://kwijibo.talis.com/","https://www.iana.org/assignments/media-types/","http://ns.inria.fr/prissma/v1#","http://purl.org/ASN/schema/core/","http://purl.org/uF/hCard/terms/","http://purl.org/archival/vocab/arch#","http://info.deepcarbon.net/schema#","https://w3id.org/won/core#","http://purl.org/ontology/is/inst/","http://purl.oclc.org/NET/muo/muo#","http://www.smileyontology.com/ns#","http://poshrdf.org/ns/posh/","http://purl.org/ontology/is/quality/","http://diplomski.nelakolundzija.org/LTontology.rdf#","http://purl.org/lex#","http://www.music-encoding.org/ns/mei/","http://eulersharp.sourceforge.net/2003/03swap/human#","http://purl.org/ontology/places#","http://www.semanticdesktop.org/ontologies/2007/11/01/pimo#","http://purl.org/NET/yoda#","http://umbel.org/umbel/ne/","http://redfoot.net/2005/session#","http://ns.poundhill.com/phss/1.0/","http://www.semanticdesktop.org/ontologies/2007/05/10/nid3#","http://purl.org/ontology/is/core#","http://purl.org/ibis#","http://www.lingvoj.org/ontology#","http://dsnotify.org/vocab/eventset/0.1/","http://www.proteinontology.info/po.owl#","http://data.europa.eu/eli/ontology#","http://www.cogsci.princeton.edu/~wn/schema/","http://fliqz.com/","http://topbraid.org/sparqlmotion#","http://rdaregistry.info/Elements/a/","http://hello.com/","http://openean.kaufkauf.net/id/","http://rdf.muninn-project.org/ontologies/appearances#","http://ontologies.ezweb.morfeo-project.org/ezcontext/ns#","http://purl.org/NET/rulz#","http://vocab.ouls.ox.ac.uk/projectfunding#","http://www.agfa.com/w3c/2009/hospital#","http://www.w3.org/2003/g/data-view#","http://lod.xdams.org/reload/oad/","http://www.w3.org/2006/http#","http://purl.org/weso/ontology/computex#","http://multimedialab.elis.ugent.be/organon/ontologies/ninsuna#","http://omv.ontoware.org/2005/05/ontology#","http://ontologies.smile.deri.ie/pdo#","http://purl.org/ontology/olo/core#","http://purl.org/NET/uri#","http://purl.org/net/ldap/","http://web-semantics.org/ns/opensocial#","http://purl.org/fab/ns#","http://imi.go.jp/ns/core/rdf#","http://purl.org/vocab/psychometric-profile/","http://purl.org/twc/vocab/datafaqs#","http://weblab-project.org/core/model/property/processing/","http://vitro.mannlib.cornell.edu/ns/vitro/public#","http://data-gov.tw.rpi.edu/2009/data-gov-twc.rdf#","http://www.w3.org/2001/04/xmlenc#","http://buzzword.org.uk/rdf/personal-link-types#","http://rdfs.org/sioc/argument#","http://www4.wiwiss.fu-berlin.de/bizer/bsbm/v01/vocabulary/","http://ontologies.ezweb.morfeo-project.org/eztag/ns#","http://s.zemanta.com/ns#","http://www.loc.gov/premis/rdf/v3/","http://purl.org/spar/deo/","http://richard.cyganiak.de/","http://rdfs.org/sioc/actions#","http://purl.org/twc/vocab/between-the-edges/","http://buzzword.org.uk/rdf/h5#","http://linkedscience.org/teach/ns#","http://foaf.qdos.com/lastfm/schema/","http://bing.com/schema/media/","http://www.w3.org/ns/odrl/2/","http://www.w3.org/2000/10/annotation-ns#","http://purl.org/vso/ns#","http://purl.org/weso/cpv/","http://provenanceweb.org/ns/pml#","http://rdf.geospecies.org/ont/geospecies#","http://www.agfa.com/w3c/2009/drugTherapy#","http://purl.org/twc/ontologies/cmo.owl#","http://launchpad.net/rdf/launchpad#","http://madskills.com/public/xml/rss/module/trackback/","http://www.w3.org/2005/01/wai-rdf/GUIRoleTaxonomy#","http://www.semanticdesktop.org/ontologies/2007/04/02/ncal#","http://data.totl.net/tarot/card/","http://www.bbc.co.uk/ontologies/news/","http://models.okkam.org/ENS-core-vocabulary#","http://eulersharp.sourceforge.net/2003/03swap/agent#","http://purl.org/tripfs/2010/02#","http://open-services.net/ns/core#","http://www.ashutosh.com/test/","http://purl.org/ontology/dso#","http://purl.org/net/provenance/types#","http://dbpedia.org/datatype/","http://webtlab.it.uc3m.es/","http://purl.org/wai#","http://www.eclap.eu/schema/eclap/","http://rdf.alchemyapi.com/rdf/v1/s/aapi-schema#","http://vocab.data.gov/def/fea#","http://vocab.deri.ie/c4n#","http://vocab.deri.ie/br#","http://purl.org/derecho#","http://purl.org/b2bo#","http://lsdis.cs.uga.edu/projects/semdis/opus#","http://callimachusproject.org/rdf/2009/framework#","http://vocab.linkeddata.es/urbanismo-infraestructuras/territorio#","http://telegraphis.net/ontology/geography/geography#","http://www.semanlink.net/2001/00/semanlink-schema#","http://collection.britishmuseum.org/id/ontology/","http://www.w3.org/1999/xhtml/vocab/","http://voag.linkedmodel.org/schema/voag#","http://www.agetec.org/","http://publications.europa.eu/ontology/euvoc#","http://purl.org/swan/1.2/pav/","http://data.ordnancesurvey.co.uk/ontology/postcode/","http://eulersharp.sourceforge.net/2003/03swap/care#","http://www.inria.fr/acacia/corese#","http://www.nanopub.org/nschema#","http://www.ifomis.org/bfo/1.1/span#","http://www.mygrid.org.uk/ontology#","http://eprints.org/ontology/","http://tobyinkster.co.uk/#","http://semanticweb.cs.vu.nl/2009/11/sem/","http://opacplus.bsb-muenchen.de/title/","http://zbw.eu/namespaces/zbw-extensions/","http://purl.org/olia/stanford.owl#","http://www.rdaregistry.info/","http://data.ordnancesurvey.co.uk/id/","http://eulersharp.sourceforge.net/2003/03swap/languages#","http://www.w3.org/2002/01/bookmark#","http://scubadive.networld.to/dive.rdf#","http://purl.org/rdo/ns#","http://securitytoolbox.appspot.com/securityAlgorithms#","http://ns.inria.fr/ast/sql#","http://www.gsi.dit.upm.es/ontologies/marl/ns#","http://persistence.uni-leipzig.org/nlp2rdf/ontologies/rlog#","http://purl.org/dita/ns#","http://purl.obolibrary.org/obo/IAO_","http://users.utcluj.ro/~raluca/ontology/Ontology1279614123500.owl#","http://www.thomsonreuters.com/","http://purl.org/vocab/frbr/extended#","http://datos.localidata.com/def/City#","http://geovocab.org/spatial#","http://datos.bne.es/resource/","http://linkedmultimedia.org/sparql-mm/ns/2.0.0/function#","http://www.ontologyportal.org/WordNet.owl#","http://akonadi-project.org/ontologies/aneo#","http://purl.org/req/","http://inference-web.org/2.0/pml-trust.owl#","http://dd.eionet.europa.eu/vocabulary/common/nuts/","http://sws.geonames.org/","http://www.agfa.com/w3c/2009/hemogram#","http://spatial.ucd.ie/lod/osn/","http://purl.org/ontology/wi/core#","http://vocab.deri.ie/ppo#","http://purl.org/NET/schema-org-csv#","http://wiss-ki.eu/","http://def.esd.org.uk/","http://xmlns.notu.be/aair#","http://ogp.me/ns/article#","http://purl.org/biodiversity/taxon/","http://purl.org/weso/uni/uni.html#","http://data.ign.fr/def/geometrie#","http://www.w3.org/2004/02/image-regions#","http://www4.wiwiss.fu-berlin.de/bizer/r2r/","http://www.w3.org/ns/sawsdl#","http://purl.org/obo/owl/NCBITaxon#","http://www.semanticweb.org/ontologies/2010/6/Ontology1279614123500.owl#","http://rdaregistry.info/Elements/m/","http://www.isocat.org/ns/dcr.rdf#","http://freedesktop.org/standards/xesam/1.0/core#","http://eulersharp.sourceforge.net/2003/03swap/units#","http://purl.org/signature#","http://www.openmobilealliance.org/tech/profiles/UAPROF/ccppschema-20021212#","http://life.deri.ie/schema/","http://purl.org/metainfo/terms/dsp#","http://semanticdiet.com/schema/usda/nndsr/","http://ontologies.hypios.com/out#","http://purl.org/tcga/core#","http://rdf.freebase.com/ns/location/geocode/","http://ontologydesignpatterns.org/","http://lukasblaho.sk/football_league_schema#","http://knoesis.wright.edu/provenir/provenir.owl#","http://www.geneontology.org/formats/oboInOwl#","http://webtlab.it.uc3m.es/2010/10/WebAppsOntology#","http://www.irit.fr/recherches/MELODI/ontologies/SAN#","http://purl.org/net/vocab/2004/07/visit#","http://www.linkedmodel.org/schema/vaem#","http://purl.org/swan/1.2/citations/","http://www.linkedmodel.org/1.0/schema/decl#","http://vocab.sindice.com/xfn#","http://ecoinformatics.org/oboe/oboe.1.0/oboe-core.owl#","http://purl.org/vra/","http://vocab.sindice.net/","http://prefix.cc/","http://eulersharp.sourceforge.net/2003/03swap/organization#","http://purl.org/makolab/caont/","http://dev.w3.org/cvsweb/2000/quacken/vocab#","http://geni-orca.renci.org/owl/topology.owl#","http://worldbank.270a.info/classification/","http://purl.org/net/opmv/types/gridworks#","http://pleiades.stoa.org/places/","http://commons.psi.enakting.org/def/","http://www.mit.jyu.fi/ai/TRUST_Ontologies/QA.owl#","http://d-nb.info/standards/elementset/agrelon#","http://www.w3.org/1999/XSL/Transform#","http://ns.inria.fr/emoca#","http://data.linkedct.org/vocab/","http://purl.org/ontology/prv/rules#","http://stanbol.apache.org/ontology/disambiguation/disambiguation#","http://foodable.co/ns/","http://purl.org/spar/c4o/","http://models.okkam.org/ENS-core-vocabulary.owl#","http://purl.org/ontology/cco/mappings#","http://datos.gob.es/def/sector-publico/organizacion#","http://www.oegov.org/core/owl/gc#","http://data.eurecom.fr/ontology/reve#","http://aims.fao.org/aos/common/","http://dbpedia.org/resource/Template:","http://www.metalex.eu/schema/1.0#","http://worldbank.270a.info/property/","http://purl.org/voc/hp/","http://www.infosys.com/","http://www.w3.org/TR/2003/PR-owl-guide-20031209/food#","http://escience.rpi.edu/ontology/semanteco/2/0/pollution.owl#","http://data.linkedmdb.org/sparql/","http://ns.aksw.org/spatialHierarchy/","http://skipforward.net/skipforward/resource/","http://kdo.render-project.eu/kdo#","http://vocab.org/transit/terms/","http://purl.org/theatre#","http://oanda2rdf.appspot.com/xch/","http://dayta.me/resource#","http://vocab.resc.info/communication#","http://ns.aksw.org/Evolution/","http://eulersharp.sourceforge.net/2003/03swap/countries#","http://rdf.insee.fr/def/geo#","http://ecb.270a.info/class/1.0/","http://eulersharp.sourceforge.net/2003/03swap/bioSKOSSchemes#","http://eulersharp.sourceforge.net/2003/03swap/event#","http://www.w3.org/ns/csvw#","http://semantictweet.com/","http://purl.org/net/opmv/ns#","http://linkedrecipes.org/schema/","http://www.w3.org/2007/ont/unit#","http://purl.org/NET/cidoc-crm/core#","http://purl.org/amicroformat/arecipe/","http://www.xbrl.org/2003/instance#","http://www.w3.org/2000/10/swap/set#","http://purl.org/restdesc/http-template#","http://www.wsmo.org/ns/wsmo-lite#","http://data.press.net/ontology/stuff/","http://sweet.jpl.nasa.gov/2.0/mathOperation.owl#","http://hxl.humanitarianresponse.info/ns/#","http://obofoundry.org/ro/ro.owl#","http://nl.ijs.si/ME/owl/","http://data.press.net/ontology/asset/","http://purl.org/twc/health/vocab/","http://www.rdfabout.com/rdf/usgov/geo/us/","http://krauthammerlab.med.yale.edu/ontologies/gelo#","http://stanbol.apache.org/ontology/enhancer/enhancer#","http://rdf.ontology2.com/vocab#","http://sw-portal.deri.org/ontologies/swportal#","http://aims.fao.org/aos/jita/","http://purl.org/procurement/public-contracts-czech#","http://www.w3.org/ns/rad#","http://www.w3.org/2000/10/swap/reason#","https://saref.etsi.org/core/","http://swat.cse.lehigh.edu/resources/onto/aigp.owl#","http://purl.org/swan/1.2/agents/","http://purl.org/obo/owl/SO#","http://purl.org/spar/doco/","http://purl.org/adms/sw/","http://dati.senato.it/osr/","http://west.uni-koblenz.de/ontologies/2010/07/dgfoaf.owl#","http://ns.rww.io/wapp#","http://data.ordnancesurvey.co.uk/ontology/50kGazetteer/","http://www.w3.org/TR/SVG/","http://eulersharp.sourceforge.net/2003/03swap/fl-rules#","http://wifo-ravensburg.de/semanticweb.rdf#","http://data.ign.fr/ontologies/geofla#","http://purl.org/ctic/empleo/oferta#","http://www.linkedmodel.org/schema/dtype#","http://eulersharp.sourceforge.net/2003/03swap/genomeAbnormality#","http://purl.org/vocommons/bridge#","http://aers.data2semantics.org/vocab/","http://purl.org/net/wf-motifs#","http://proton.semanticweb.org/2005/04/protons#","http://jena.hpl.hp.com/ARQ/property#","http://spinrdf.org/spif#","http://eulersharp.sourceforge.net/2006/02swap/fcm#","http://eulersharp.sourceforge.net/2003/03swap/prolog#","http://www.w3.org/2011/http-methods#","http://www.padinthecity.com/","http://vocab.deri.ie/nocal#","http://data.kasabi.com/dataset/italy/schema/","http://data.press.net/ontology/event/","http://purl.org/cerif/frapo/","http://myprefix.org/","http://rdf.insee.fr/def/demo#","http://jicamaro.info/mp#","http://simile.mit.edu/2003/10/ontologies/artstor#","http://purl.org/carfo#","http://jena.hpl.hp.com/Eyeball#","http://labs.mondeca.com/vocab/endpointStatus#","http://www.agfa.com/w3c/2009/clinicalEvaluation#","http://trust.utep.edu/visko/ontology/visko-operator-v3.owl#","http://rdaregistry.info/Elements/w/","http://www.daml.org/2001/09/countries/iso-3166-ont#","http://purl.org/twc/vocab/cross-topix#","http://purl.org/commerce/creditcard#","http://www.w3.org/2003/05/soap-envelope/","http://www.tvblob.com/ratings/#","http://www.tei-c.org/ns/1.0/","http://penis.to/#","http://purl.org/weso/ontologies/scowt#","http://rdflivenews.aksw.org/ontology/","http://rightsstatements.org/vocab/","http://data.nytimes.com/","http://cbasewrap.ontologycentral.com/vocab#","http://purl.org/telix#","http://www.e-lico.eu/data/kupkb/","http://www.openk.org/wscaim.owl#","http://www.purl.org/ontologia/eseduc#","http://stats.data-gov.ie/property/","http://www.researchspace.org/ontology/","http://www.w3.org/2007/rif-builtin-function#","http://purl.org/nxp/schema/v1/","http://bio2rdf.org/hgnc:","http://prov4j.org/w3p/","http://www.w3.org/ns/openannotation/extensions/","http://www.ebi.ac.uk/gxa/","http://bioinformatics.ua.pt/coeus/","http://purl.org/net/dssn/","http://spatial.ucd.ie/2012/08/osmsemnet/","http://data.linkedct.org/vocab/resource/","http://www.lotico.com/ontology/","http://www.w3.org/2005/01/wf/flow#","http://www.daml.org/services/owl-s/1.2/Service.owl#","http://ontology.ip.rm.cnr.it/ontologies/DOLCE-Lite#","http://ontojob.at/","http://vocab.deri.ie/sad#","http://data.lirmm.fr/ontologies/osp#","http://poderopedia.com/vocab/","http://data.nytimes.com/elements/","http://www.openlinksw.com/virtrdf-data-formats#","http://saxon.sf.net/","http://purl.org/ontology/storyline/","http://openlinksw.com/services/facets/1.0/","http://govwild.org/0.6/GWOntology.rdf/","http://eulergui.sourceforge.net/contacts.owl.n3#","http://open-services.net/ns/crtv#","http://purl.org/wf4ever/wfdesc#","http://www.nexml.org/2009/","http://purl.org/microformat/hmedia/","http://www.owl-ontologies.com/generations.owl#","http://buzzword.org.uk/rdf/vcardx#","http://purl.org/ontology/places/","http://eulersharp.sourceforge.net/2003/03swap/humanBody#","http://purl.org/twc/vocab/centrifuge#","http://opengraph.org/schema/","http://www.w3.org/TR/owl-time#","http://purl.org/olia/mte/multext-east.owl#","http://purl.org/voc/ling/","http://vocab.deri.ie/fingal#","http://rinfo.lagrummet.se/ns/2008/11/rinfo/publ#","http://www.agfa.com/w3c/2009/healthCare#","http://purl.org/twc/ontologies/identity.owl#","http://www4.wiwiss.fu-berlin.de/diseasome/resource/diseasome/","http://www.openannotation.org/ns/","http://purl.org/ontology/daia/Service/","http://iflastandards.info/ns/fr/frad/","http://purl.org/configurationontology#","http://rdf.myexperiment.org/ontologies/base/","http://purl.org/ontology/ecpo#","http://rdf.data-vocabulary.org/","http://purl.oclc.org/NET/ssnx/qu/qu#","http://purl.org/twc/vocab/goef#","http://eulersharp.sourceforge.net/2003/03swap/environment#","http://lod2.eu/schema/","https://id.parliament.uk/schema/","http://prismstandard.org/namespaces/pam/2.0/","http://zbw.eu/beta/p20/vocab/","http://www.mygrid.org.uk/mygrid-moby-service#","http://kwantu.net/kw/","http://www.essepuntato.it/2012/04/tvc/","http://nlp2rdf.lod2.eu/schema/string/","http://vocab.lenka.no/geo-deling#","http://km.aifb.kit.edu/projects/numbers/number#","http://reference.data.gov.uk/technical-registry/","http://www.agfa.com/w3c/2009/malignantNeoplasm#","http://sites.wiwiss.fu-berlin.de/suhl/bizer/d2r-server/config.rdf#","http://pokedex.dataincubator.org/pkm/","http://ns.nature.com/datasets/","http://oecd.270a.info/dataset/","http://ns.inria.fr/s4ac/v2#","http://www.freeclass.eu/freeclass_v1#","http://archdesc.info/archEvent#","http://purl.org/ontology/gbv/","http://sites.google.com/site/xgmaitc/","http://www.w3.org/2004/ql#","http://data.semanticweb.org/conference/ekaw/2012/complete/","http://manesht.ir/","http://labels4all.info/ns/","http://purl.org/tripfs/2010/06#","http://atomowl.org/ontologies/atomrdf#","http://lod.gesis.org/lodpilot/ALLBUS/vocab.rdf#","http://escience.rpi.edu/ontology/sesf/s2s/4/0/","http://openknowledgegraph.org/ontology/","http://xmlns.com/aerols/0.1/","http://www.agfa.com/w3c/2009/clinicalProcedure#","http://ns.inria.fr/webmarks#","http://ontology.it/itsmo/v1#","http://www.opmw.org/ontology/","http://purl.org/imbi/ru-meta.owl#","http://schema.wolterskluwer.de/","http://purl.org/NET/cloudisus#","http://ns.inria.fr/l4lod/v2/","http://datos.bcn.cl/ontologies/bcn-congress#","http://ns.nature.com/graphs/","http://purl.org/ontology/iron#","http://kwijibo.talis.com/vocabs/puelia#","https://ontologies.semanticarts.com/gist/","http://purl.org/wf4ever/wfprov#","http://www.onto-med.de/ontologies/gfo.owl#","http://tackbp.org/2013/ontology#","http://vocab.ox.ac.uk/camelot#","http://prismstandard.org/namespaces/basic/2.1/","http://aims.fao.org/aos/geopolitical.owl#","http://rhizomik.net/ontologies/2005/03/Mpeg7-2001.owl#","http://purl.org/net/biordfmicroarray/ns#","http://vocab.inf.ed.ac.uk/library/holdings#","http://data.totl.net/occult/","http://purl.org/cld/cdtype/","http://data.lirmm.fr/ontologies/laposte#","http://geovocab.org/","http://protege.stanford.edu/plugins/owl/dc/protege-dc.owl#","http://www.ontologydesignpatterns.org/ont/framenet/abox/frame/","http://datos.bcn.cl/ontologies/bcn-norms#","http://openskos.org/xmlns#","http://opendata.cz/infrastructure/odcleanstore/","https://w3id.org/cdt/","http://bio2rdf.org/ns/ns/ns/pubchem#","http://www.openlinksw.com/campsites/schema#","http://vocab.linkeddata.es/datosabiertos/def/urbanismo-infraestructuras/direccion-postal#","http://www.w3.org/2001/02pd/rec54.rdf#","http://clarin.eu/cmd#","http://code-research.eu/ontology/visual-analytics#","http://www.openlinksw.com/ski_resorts/schema#","http://www.ontotext.com/owlim/lucene#","http://proton.semanticweb.org/protonsys#","http://dbpedia.org/class/yago/","http://www.ordnancesurvey.co.uk/ontology/Datatypes.owl#","http://data.scientology.org/ns/","http://www.w3.org/2008/05/skos#","http://www.w3.org/2001/sw/hcls/ns/transmed/","http://semantic.eurobau.com/eurobau-utility.owl#","http://www.ebsemantics.net/gastro#","https://vg.no/","http://escience.rpi.edu/ontology/vsto/2/0/vsto.owl#","http://rdf.ebi.ac.uk/vocabulary/zooma/","http://www.ontologydesignpatterns.org/ont/framenet/abox/fe/","http://www.co-ode.org/ontologies/pizza/pizza.owl#","http://harrisons.cc/","http://eulersharp.sourceforge.net/2003/03swap/quantitiesExtension#","http://www.w3.org/2006/time-entry#","http://securitytoolbox.appspot.com/stac#","http://www.w3.org/2001/sw/DataAccess/tests/test-dawg#","http://ns.aksw.org/scms/annotations/","http://purl.org/twc/cabig/model/HINTS2005-1.owl#","http://mmisw.org/ont/cf/parameter/","http://rdf.muninn-project.org/ontologies/military#","https://w3id.org/cdc#","http://observedchange.com/tisc/ns#","http://purl.org/germplasm/terms#","http://openlinksw.com/schema/attribution#","http://purl.org/csm/1.0#","https://w3id.org/ops#","http://psh.techlib.cz/skos/","https://w3id.org/cc#","http://www.telegraphis.net/ontology/measurement/measurement#","http://www.ontotext.com/proton/protontop#","http://rdaregistry.info/Elements/p/object/","http://linkedwidgets.org/statisticalwidget/ontology/","http://purl.org/ontology/fo/","http://ndl.go.jp/dcndl/terms/","http://purl.org/net/hifm/data#","http://salt.semanticauthoring.org/ontologies/sro#","http://purl.org/net/soron/","http://abs.270a.info/dataset/","http://gov.genealogy.net/ontology.owl#","http://bio2rdf.org/pubmed_vocabulary:","http://wikiba.se/ontology#","http://semweb.mmlab.be/ns/linkedconnections#","http://www.w3.org/1999/xhtml/","http://purl.org/vocommons/bv#","http://purl.org/net/VideoGameOntology#","http://purl.org/ctic/dcat#","http://futurios.org/fos/spec/","http://ontorule-project.eu/resources/steel-30#","http://nlp2rdf.lod2.eu/schema/sso/","http://spitfire-project.eu/ontology/ns/","http://purl.org/spar/pso/","http://purl.org/twc/vocab/datacarver#","http://www.ebu.ch/metadata/ontologies/ebucore/ebucore#","http://mlode.nlp2rdf.org/quranvocab#","http://dbpedialite.org/things/","http://web.resource.org/rss/1.0/modules/syndication/","http://purl.org/ontology/paia#","http://purl.org/omapi/0.2/#","http://vocab.linkeddata.es/datosabiertos/def/urbanismo-infraestructuras/transporte#","http://www.agfa.com/w3c/2009/humanDisorder#","http://www.ontologydesignpatterns.org/cp/owl/sequence.owl#","http://schema.omg.org/spec/CTS2/1.0/","http://bihap.kb.gov.tr/ontology/","http://data.odw.tw/","http://www.w3.org/TR/2003/PR-owl-guide-20031209/wine#","http://purl.org/co/","http://www.daisy.org/z3998/2012/vocab/","http://purl.org/vocab/participation/schema#","http://dati.cdec.it/lod/shoah/","https://w3id.org/okn/o/sdm#","http://open-multinet.info/ontology/omn-lifecycle#","http://opendepot.org/reference/linked/1.0/","http://orion.tw.rpi.edu/~xgmatwc/refe/","http://def.seegrid.csiro.au/isotc211/iso19115/2003/lineage#","http://www.aifb.kit.edu/project/ld-retriever/qrl#","http://data.kasabi.com/dataset/eumida/terms/","http://environment.data.gov.au/def/op#","https://ns.eccenca.com/","http://owlrep.eu01.aws.af.cm/fridge#","http://data.eurecom.fr/ontology/dvia#","http://www.w3.org/People/Berners-Lee/card#","https://w3id.org/function/ontology#","http://purl.org/telmap/","http://purl.org/spar/biro/","http://ocean-data.org/schema/","http://escience.rpi.edu/ontology/semanteco/2/0/water.owl#","http://ns.nature.com/extensions/","http://richard.cyganiak.de/2007/pubby/config.rdf#","http://rdaregistry.info/Elements/e/","http://purl.org/eis/vocab/daq#","https://w3id.org/valueflows#","http://purl.oclc.org/NET/ldr/ns#","http://purl.org/net/cartCoord#","http://purl.oclc.org/NET/lldr/ns#","http://www.mobile.com/model/","http://kmm.lboro.ac.uk/ecos/1.0#","http://purl.org/ctic/sector-publico/elecciones#","http://sig.uw.edu/fma#","http://purl.org/swan/2.0/discourse-relationships/","http://dbpedia.org/ontology/Stream/","http://aers.data2semantics.org/resource/","http://purl.org/ontology/cosmo#","http://purl.org/ipo/core#","http://strdf.di.uoa.gr/ontology#","http://idi.fundacionctic.org/cruzar/turismo#","http://webbox.ecs.soton.ac.uk/ns#","http://linkedspending.aksw.org/ontology/","http://observedchange.com/moac/ns#","http://www.lingvoj.org/semio#","http://www.gsi.dit.upm.es/ontologies/onyx/ns#","http://data.ordnancesurvey.co.uk/ontology/geometry/","http://purl.org/twc/vocab/opendap#","http://purl.org/spar/datacite/","http://vocab.data.gov/def/drm#","http://rdvocab.info/termList/RDAMediaType/","http://verticalsearchworks.com/ontology/","http://advene.org/ns/cinelab/","http://eunis.eea.europa.eu/rdf/species-schema.rdf#","http://purl.org/finlex/schema/oikeus/","http://www.w3.org/ns/solid/terms#","http://dbtune.org/musicbrainz/resource/instrument/","http://purl.org/finlex/schema/laki/","http://paul.staroch.name/thesis/SmartHomeWeather.owl#","http://www.who.int/vocab/ontology#","http://doc.metalex.eu/bwb/ontology/","http://rdvocab.info/termList/RDACarrierType/","http://purl.org/net/po#","http://qudt.org/1.1/schema/qudt#","http://institutions.publicdata.eu/#","http://hospee.org/ontologies/dpc/","http://datos.bcn.cl/ontologies/bcn-biographies#","http://deductions.github.io/doas.owl.ttl#","http://purl.org/ontology/ssso#","http://mged.sourceforge.net/ontologies/MGEDOntology.owl#","http://purl.org/net/lio#","http://lod.ac/ns/lodac#","http://verticalsearchworks.com/ontology/synset#","http://www.ontologydesignpatterns.org/ont/dul/IOLite.owl#","http://vocab.ox.ac.uk/projectfunding#","http://data.semanticweb.org/person/","http://www.w3.org/ns/radion#","http://data.lirmm.fr/ontologies/poste#","http://www.newmedialab.at/fcp/","http://purl.obolibrary.org/obo/agro.owl#","http://purl.org/hpi/guo#","http://purl.org/oslo/ns/localgov#","http://purl.org/voc/vrank#","http://ontologycentral.com/2010/05/cb/vocab#","http://www.provbook.org/ns/#","http://linkedscience.org/lsc/ns#","http://wiktionary.dbpedia.org/terms/","http://swpatho.ag-nbi.de/context/meta.owl#","http://purl.org/net/provenance/integrity#","http://purl.org/NET/ordf/","http://nidm.nidash.org/","http://purl.org/datanode/ns/","http://www.ics.forth.gr/isl/oncm/core#","http://purl.org/dqm-vocabulary/v1/dqm#","http://erlangen-crm.org/current/","http://vocab.fusepool.info/fam#","http://ns.cerise-project.nl/energy/def/cim-smartgrid#","http://purl.org/twc/vocab/vsr/graffle#","http://purl.org/wf4ever/roevo#","http://www.telegraphis.net/ontology/measurement/quantity#","http://tw.rpi.edu/schema/","http://purl.org/NET/cpan-uri/terms#","http://contextus.net/ontology/ontomedia/misc/date#","http://gadm.geovocab.org/ontology#","http://www.ontologydesignpatterns.org/cp/owl/timeindexedsituation.owl#","http://purl.org/twc/vocab/aapi-schema#","http://www.openlinksw.com/ontology/licenses#","https://project-open-data.cio.gov/v1.1/schema/#","http://wwwiti.cs.uni-magdeburg.de/~srahman/","http://rdf.ebi.ac.uk/terms/chembl#","http://def.seegrid.csiro.au/isotc211/iso19156/2011/sampling#","http://www.joshuajeeson.com/","http://dx.deepcarbon.net/","http://ns.inria.fr/ratio4ta/v1#","http://purl.org/biotop/biotop.owl#","http://webofcode.org/wfn/call:","http://rdvocab.info/termList/RDAContentType/","http://openprovenance.org/model/opmo#","http://data.press.net/ontology/tag/","http://contextus.net/ontology/ontomedia/ext/common/trait#","http://eatld.et.tu-dresden.de/rmo#","https://www.ecma-international.org/publications/files/ECMA-ST/ECMA-404.pdf#","http://gawd.atlantides.org/terms/","http://www.essepuntato.it/2008/12/pattern#","http://www.geocontext.org/publ/2013/vocab#","http://data.lirmm.fr/ontologies/vdpp#","http://www.mico-project.eu/ns/platform/1.0/schema#","http://www.agfa.com/w3c/2009/infectiousDisorder#","http://www.enakting.org/provenance/voidp/","https://w3id.org/verb/","http://purl.org/net/pingback/","http://opendata.caceres.es/def/ontosemanasanta#","http://www.ics.forth.gr/isl/CRMdig/","https://triplydb.com/Triply/tp/def/","http://www.icane.es/opendata/vocab#","http://rdf.geospecies.org/methods/observationMethod#","http://ns.bergnet.org/tac/0.1/triple-access-control#","http://rdf.muninn-project.org/ontologies/graves#","http://lod.taxonconcept.org/ses/","http://data.europa.eu/esco/model#","http://www.ordnancesurvey.co.uk/ontology/SpatialRelations/v0.2/SpatialRelations.owl#","http://musicbrainz.org/ns/mmd-1.0#","http://vocab.deri.ie/csp#","http://purl.oclc.org/POIS/vcblr#","http://purl.org/ctic/infraestructuras/organizacion#","http://trust.utep.edu/visko/ontology/visko-view-v3.owl#","http://aims.fao.org/aos/agrovoc/","http://rdflivenews.aksw.org/resource/","http://www.w3.org/2004/delta#","http://vocab.deri.ie/odapp#","http://schema.googleapis.com/","http://elite.polito.it/ontologies/dogont.owl#","http://purl.org/wf4ever/roterms#","http://metadataregistry.org/uri/schema/RDARelationshipsGR2/","http://users.ugent.be/~bjdmeest/function/grel.ttl#","https://www.w3.org/2019/wot/td#","http://purl.org/net/wf4ever/ro#","http://purl.oclc.org/NET/mvco.owl#","http://purl.org/NET/lindt#","http://rdf.ebi.ac.uk/resource/atlas/","http://bibliograph.net/schemas/","http://xlime-project.org/vocab/","http://yovisto.com/","http://reference.data.gov.uk/def/organogram/","http://purl.org/vvo/ns#","http://purl.org/olap#","http://ontologi.es/doap-deps#","http://vapour.sourceforge.net/vocab.rdf#","http://pkgsrc.co/schema#","http://w3id.org/ost/ns#","http://purl.org/captsolo/resume-rdf/0.2/base#","http://iflastandards.info/ns/fr/frbr/frbrer/","http://schema.geolink.org/","http://purl.org/net/evident#","http://purl.org/spar/pwo/","http://purl.org/rdfstats/stats#","http://schema.mobivoc.org/","http://babelnet.org/rdf/","http://www.agls.gov.au/agls/terms/","http://kai.uni-kiel.de/","http://resource.geosciml.org/ontology/timescale/thors#","http://purl.bioontology.org/ontology/MESH/","http://data.globalchange.gov/gcis.owl#","http://purl.org/provenance/w3p/w3po#","http://openlad.org/vocab#","http://purl.org/lex/cz#","https://id.kb.se/vocab/","http://frb.270a.info/dataset/","http://purl.org/viso/","http://data.posccaesar.org/rdl/","http://fao.270a.info/dataset/","http://def.seegrid.csiro.au/isotc211/iso19109/2005/feature#","http://www.oegov.org/core/owl/cc#","http://def.seegrid.csiro.au/isotc211/iso19107/2003/geometry#","http://purl.org/locwd/schema#","http://rdaregistry.info/Elements/i/","http://rdaregistry.info/termList/RDAMediaType/","http://jmvanel.free.fr/ontology/software_applications.n3#","http://rdvocab.info/roles/","http://www.daml.org/services/owl-s/1.2/generic/Expression.owl#","http://bg.dbpedia.org/resource/?????????:","http://w3id.org/art/terms/1.0/","http://clarin.eu/fcs/resource#","http://purl.org/vocab/cpsv#","http://www.w3.org/ns/sosa/","http://dbtropes.org/ont/","http://iflastandards.info/ns/fr/frsad/","http://purl.org/NET/ssnext/electricmeters#","http://ns.taverna.org.uk/2010/scufl2#","http://www.ordnancesurvey.co.uk/ontology/Topography/v0.1/Topography.owl#","http://data.lirmm.fr/ontologies/oan/","http://purl.org/spar/scoro/","https://www.w3.org/2006/vcard/ns#latitude#","http://www.geonames.org/ontology/mappings/","http://www.ogbd.fr/2012/ontologie#","http://www.openlinksw.com/ontology/products#","http://data.press.net/ontology/classification/","http://www.wordnet.dk/owl/instance/2009/03/instances/","http://purl.org/vocabularies/amalgame#","http://rdvocab.info/uri/schema/FRBRentitiesRDA/","http://rdf.myexperiment.org/ontologies/snarm/","http://purl.org/provone#","http://purl.org/ontology/holding#","http://vocab.deri.ie/raul#","http://qudt.org/schema/quantity#","http://www.s3db.org/core#","http://uis.270a.info/dataset/","http://linkedspending.aksw.org/instance/","http://swat.cse.lehigh.edu/onto/univ-bench.owl#","http://purl.org/LiMo/0.1/","http://def.seegrid.csiro.au/isotc211/iso19115/2003/extent#","http://www.ontologydesignpatterns.org/ont/dul/ontopic.owl#","http://www.w3.org/2006/03/wn/wn20/",